# SQLite dan Pandas

In [13]:
import pandas as pd
import sqlite3

In [14]:
pd.__version__

'2.2.2'

### SQLite Connection

In [15]:
sqlitedb = 'demo2.db'

conn = sqlite3.connect(sqlitedb)
cursor = conn.cursor()
conn

### Load SQLite

In [16]:
df = pd.read_sql_query("select * from employee", conn)
df

   id   full_name  age                email
0   1  employee 1   20  employee1@gmail.com
1   2  employee 2   20  employee2@gmail.com
2   3  employee 3   20  employee3@gmail.com
3   4  employee 4   20  employee4@gmail.com
4   5  employee 5   20  employee5@gmail.com
5   7  employee 2   20  employee2@gmail.com
6   8  employee 3   20  employee3@gmail.com
7   9  employee 9   14  employee9@gmail.com
8  10  employee 5   20  employee5@gmail.com
9  11  employee 6   40  employee6@gmail.com

In [17]:
# Pandas dataframe to table

product = {
  'name' : ['Product A1', 'Product A2', 'Product A3'],
  'code' : ['E01', 'D02', 'G05'],
  'price' : [2.1, 3.6, 3.5],
  'quantity' : [5,7,8],
  'created' : ['2020-10-08 20:12:21', '2020-08-06 18:05:59', '2021-04-13 02:12:35']
}

dataFrame = pd.DataFrame(data=product)
dataFrame

         name code  price  quantity              created
0  Product A1  E01    2.1         5  2020-10-08 20:12:21
1  Product A2  D02    3.6         7  2020-08-06 18:05:59
2  Product A3  G05    3.5         8  2021-04-13 02:12:35

In [18]:
# Save dataframe to SQLite table
tableName = 'product'
dataFrame.to_sql(tableName, con=conn, index=False, if_exists='append')
print('Success')

Success

In [24]:
df = pd.read_sql("SELECT * FROM product",conn)
df

         name code  price  quantity              created
0  Product A1  E01    2.1         5  2020-10-08 20:12:21
1  Product A2  D02    3.6         7  2020-08-06 18:05:59
2  Product A3  G05    3.5         8  2021-04-13 02:12:35
3  Product A1  E01    2.1         5  2020-10-08 20:12:21
4  Product A2  D02    3.6         7  2020-08-06 18:05:59
5  Product A3  G05    3.5         8  2021-04-13 02:12:35